In [1]:
#pip install word2number

In [2]:
import word2number as w2n
from word2number import w2n
import pandas as pd
from sklearn import linear_model

In [3]:
df=pd.read_csv(r"C:\Users\akank\OneDrive\Desktop\MachineLearning\multi_data.csv")

In [4]:
df.columns

Index(['experience', 'test_score', 'interview_score', 'salary'], dtype='object')

In [5]:
df.experience= df.experience.fillna('zero')
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [6]:
df.experience = df.experience.apply(w2n.word_to_num)

In [7]:
df.experience

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [8]:
median_test=(df.test_score.median())

In [9]:
median_test

8.0

In [10]:
df.test_score=df.test_score.fillna(median_test)

In [11]:
df.test_score

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score, dtype: float64

In [12]:
reg=linear_model.LinearRegression()

In [13]:
new_df=df.drop('salary',axis='columns')

In [14]:
new_df

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6
5           3         7.0               10
6          10         8.0                7
7          11         7.0                8

In [15]:
reg.fit(new_df,df.salary)

LinearRegression()

In [16]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [17]:
reg.intercept_

17737.263464337688

In [18]:
reg.predict([[2,9,6]])

C:\ProgramData\Anaconda\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])